### Crie uma Series que contenha os dias da semana como índices e valores de 1 a 7. Em seguida, extraia o valor correspondente a "quarta-feira" usando o índice.

In [3]:
import pandas as pd
from numpy.random import randn, randint
import datetime

In [5]:
lista_01 = [1, 2, 3, 4, 5, 6, 7]
serie_dias = pd.Series(lista_01, index="seg ter qua qui sex sab dom".split())
serie_dias.loc["qua"]

3

### Crie um DataFrame com dados de vendas de uma loja, onde as colunas são Produto, Quantidade e Preço. Filtre o DataFrame para mostrar apenas os produtos com preço superior a R$ 50.

In [8]:
df_00 = pd.DataFrame(randn(3,3),index= "A B C".split(),columns="Produto quantidade preço".split())
df_00

    Produto  quantidade     preço
A  0.819881   -0.653556 -0.767726
B  3.217620    0.659460  0.684845
C  0.656544    0.271882 -0.375339

In [10]:
maisq_0 = df_00[df_00["preço"] > 0]
maisq_0

   Produto  quantidade     preço
B  3.21762     0.65946  0.684845

### Crie um DataFrame com as colunas Nome, Idade e Cidade. Adicione uma nova coluna Ano de Nascimento calculada a partir da idade.

In [13]:
list_nome = ["Davi","Rafael","Pedro"]
list_idade = [21, 33, 26]
list_cidade = ["Recife","São Paulo","Rio grande do sul"]
data = datetime.datetime.now()
ano = data.year

df_01 = pd.DataFrame(columns="nome idade cidade".split())
df_01["nome"] = list_nome
df_01["idade"] = list_idade
df_01["cidade"] = list_cidade
df_01["ano de nascimento"] = [ano - i for i in list_idade]
df_01

     nome  idade             cidade  ano de nascimento
0    Davi     21             Recife               2003
1  Rafael     33          São Paulo               1991
2   Pedro     26  Rio grande do sul               1998

### Crie um DataFrame com múltiplos níveis de índice, representando diferentes regiões e cidades. Filtre os dados para uma região específica e ordene-os por cidade.

In [29]:
outside = ["Nordeste","Nordeste","Nordeste", "Sudeste", "sul"] 
inside = ["Recife","Camaragibe","Caruaru","São Paulo","Rio grande do sul"]
hier = list(zip(outside,inside))
hier = pd.MultiIndex.from_tuples(hier)
hier

MultiIndex([('Nordeste',            'Recife'),
            ('Nordeste',        'Camaragibe'),
            ('Nordeste',           'Caruaru'),
            ( 'Sudeste',         'São Paulo'),
            (     'sul', 'Rio grande do sul')],
           )

In [31]:
df_02 = pd.DataFrame(index=hier, columns="Faturamento".split())
df_02["Faturamento"] = [10000, 3200, 9700, 6000, 900]
df_02.index.names = ["Região", "Cidade"]
df_02

                            Faturamento
Região   Cidade
Nordeste Recife                   10000
         Camaragibe                3200
         Caruaru                   9700
Sudeste  São Paulo                 6000
sul      Rio grande do sul          900

In [55]:
df_02.loc["Nordeste"].sort_values(by="Cidade")

            Faturamento
Cidade
Camaragibe         3200
Caruaru            9700
Recife            10000

### Crie duas Series com 5 elementos numéricos cada uma. Realize operações matemáticas básicas entre essas Series (adição, subtração, multiplicação e divisão).

In [100]:
numbers_01 = [5, 10, 15, 20, 25]
numbers_02 = [3, 6, 9, 12, 15]
numbers_mix = []
serie_01 = pd.Series(numbers_01)
serie_02 = pd.Series(numbers_02)

serie_03 = pd.Series([numbers_01[0]+numbers_02[0],numbers_01[1]-numbers_02[1],numbers_01[2]*numbers_02[2],numbers_01[3]/numbers_02[3],numbers_01[4]**numbers_02[4]])
serie_03

0                        8
1                        4
2                      135
3                 1.666667
4    931322574615478515625
dtype: object

### Dado um DataFrame com dados de estudantes (Nome, Nota, Curso), use o iloc para selecionar a segunda e quarta linhas e todas as colunas, exibindo os resultados.

In [113]:
alunos = ["Davi","Rafael","Geovane","Silas","Roger"]
Notas = [10,7,5,7,9]
curso = ["ADS","SI","ENGENHARIA","FILOSOFIA","ADS",]
colunas = ["Nome","Nota","Curso"]
df_03 = pd.DataFrame(columns=[colunas])
df_03["Nome"] = alunos
df_03["Nota"] = Notas
df_03["Curso"] = curso
df_03

      Nome Nota       Curso
0     Davi   10         ADS
1   Rafael    7          SI
2  Geovane    5  ENGENHARIA
3    Silas    7   FILOSOFIA
4    Roger    9         ADS

In [135]:
df_03.iloc[[2,4]]

      Nome Nota       Curso
2  Geovane    5  ENGENHARIA
4    Roger    9         ADS